"====================== Переменные==================="
num1 = 5
num2 = 10
print(num1 + num2) # 15
# переменнные - это именновванные ссылки на ячейки памяти, где хранятся какие то данные, 

"===============Ввод и вывод данных==============="
# print - функция, котороя позволяет выводить данные в терминал
# input - функция, которая позвалает принимать данные с терминала
input("Введите числож:")
print ("Введенное число -", number)

"================Правила наименования переменных==============="
a = 5 # можно, но не совсем понянтно 
1num = 10  # нельзя начинать с чисел 
hello_world = 'hello world' # для разделителя можно исползовать только_
print = 'print' # нельзя назвать переменные уже встроенными названями
# if = 4  не получится использовать в качестве переменных ключевые слова 
# Snake Case - ython стиль написания переменных 
hello_world_aaa_bbb = ''
# Camel Case - стиль написания переменных во всех других яп
helloWorldAaaBbb = ''

"================Типы данных в Python==============="
int_ = 17 
float_ = 34.0
str_ = "hello"
bool_1 = true
bool_2 = false
none_ = None 
tuple_ = (1,2,3,4,5,6,7,8)

list_ = [1,2,3,4,5,6]
set_ = {1,2,1,4} # {1,2,4}
dict_ = {'a':1, 'b':2}



